---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTrayType.ShapeType
source: html/b12eb74f-7b7d-bc8e-3bb6-ca5366aec367.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayType.ShapeType Property

Shape of this cable tray type.

## Syntax (C#)
```csharp
public CableTrayShape ShapeType { get; }
```